sundw2014/u2f_stm32/Project/src/u2f.cpp
extern "C" {
void u2f_init() {
	uECC_set_rng(&RNG);
}
}
void cleanup_timeout()
{
	int i;
	for (i = 0;  i < MAX_CHANNEL; i++) {
		//free channel that is inactive
		ch_state &c = channel_states[i];
		int m = millis();
		if (c.state != STATE_CHANNEL_AVAILABLE) {
			if ((m - c.last_millis) > TIMEOUT_VALUE) {
				c.state = STATE_CHANNEL_AVAILABLE;
			}
		}
	}
}

int allocate_new_channel()
{
	int i;
	//alloace new channel_id
	int channel_id = 1;

	do {
		bool found = false;
		for (i = 0;  i < MAX_CHANNEL; i++) {
			if (channel_states[i].state != STATE_CHANNEL_AVAILABLE) {
				if (channel_states[i].cid == channel_id) {
					found = true;
					channel_id++;
					break;
				}
			}
		}
		if (!found)
			break;
	} while (true);
	return channel_id;
}

int allocate_channel(int channel_id)
{
	int i;
	if (channel_id==0) {
		channel_id =  allocate_new_channel();
	}

	bool has_free_slots = false;
	for (i = 0;  i < MAX_CHANNEL; i++) {
		if (channel_states[i].state == STATE_CHANNEL_AVAILABLE) {
			has_free_slots = true;
			break;
		}
	}
	if (!has_free_slots)
		cleanup_timeout();

	for (i = 0;  i < MAX_CHANNEL; i++) {
		ch_state &c = channel_states[i];
		if (c.state == STATE_CHANNEL_AVAILABLE) {
			c.cid = channel_id;
			c.state = STATE_CHANNEL_WAIT_PACKET;
			c.last_millis = millis();
			return channel_id;
		}
	}
	return 0;
}

int initResponse(byte *buffer)
{
#ifdef DEBUG
	DBG_MSG("INIT RESPONSE");
#endif
	int cid = *(int*)buffer;
#ifdef DEBUG
	// Serial.println(cid, HEX);
#endif
	int len = buffer[5] << 8 | buffer[6];
	int i;
	memcpy(resp_buffer, buffer, 5);
	SET_MSG_LEN(resp_buffer, 17);
	memcpy(resp_buffer + 7, buffer + 7, len); //nonce
	i = 7 + len;
	if (cid==-1) {
		cid = allocate_channel(0);
	} else {
#ifdef DEBUG
		DBG_MSG("using existing CID");
#endif
		allocate_channel(cid);
	}
	memcpy(resp_buffer + i, &cid, 4);
	i += 4;
	resp_buffer[i++] = U2FHID_IF_VERSION;
	resp_buffer[i++] = 1; //major
	resp_buffer[i++] = 0;
	resp_buffer[i++] = 1; //build
	//resp_buffer[i++] = CAPABILITY_WINK; //capabilities
	resp_buffer[i++] = 0; //capabilities
#ifdef DEBUG
	DBG_MSG("SENT RESPONSE 1");
#endif
	RawHID_send(resp_buffer, 64);
#ifdef DEBUG
	// Serial.println(cid, HEX);
#endif
	return cid;
}


void errorResponse(byte *buffer, int code)
{
        memcpy(resp_buffer, buffer, 4);
        resp_buffer[4] = U2FHID_ERROR;
        SET_MSG_LEN(resp_buffer, 1);
        resp_buffer[7] = code & 0xff;
#ifdef DEBUG
	// Serial.print("SENT RESPONSE error:");
	// DBG_MSG(code);
#endif
	RawHID_send(resp_buffer, 64);
}


//find channel index and update last access
int find_channel_index(int channel_id)
{
	int i;

	for (i = 0;  i < MAX_CHANNEL; i++) {
		if (channel_states[i].cid==channel_id) {
			channel_states[i].last_millis = millis();
			return i;
		}
	}

	return -1;
}

#define IS_CONTINUATION_PACKET(x) ( (x) < 0x80)
#define IS_NOT_CONTINUATION_PACKET(x) ( (x) >= 0x80)

#define SW_NO_ERROR                       0x9000
#define SW_CONDITIONS_NOT_SATISFIED       0x6985
#define SW_WRONG_DATA                     0x6A80
#define SW_WRONG_LENGTH                     0x6700
#define SW_INS_NOT_SUPPORTED 0x6D00
#define SW_CLA_NOT_SUPPORTED 0x6E00


#define APPEND_SW(x, v1, v2) do { (*x++)=v1; (*x++)=v2;} while (0)
#define APPEND_SW_NO_ERROR(x) do { (*x++)=0x90; (*x++)=0x00;} while (0)



void respondErrorPDU(byte *buffer, int err)
{
	SET_MSG_LEN(buffer, 2); //len("") + 2 byte SW
	byte *datapart = buffer + 7;
	APPEND_SW(datapart, (err >> 8) & 0xff, err & 0xff);
	RawHID_send(buffer, 64);
}

void sendLargeResponse(byte *request, int len)
{
#ifdef DEBUG
	DBG_MSG("Sending large response,len=%d",len);
	// DBG_MSG(len);
	dump_hex(large_resp_buffer,len);
#endif
	memcpy(resp_buffer, request, 4); //copy cid
	resp_buffer[4] = U2FHID_MSG;
	int r = len;
	if (r>MAX_INITIAL_PACKET) {
		r = MAX_INITIAL_PACKET;
	}

	SET_MSG_LEN(resp_buffer, len);
	memcpy(resp_buffer + 7, large_resp_buffer, r);

	RawHID_send(resp_buffer, 64);
	// delayMicroseconds(2500);
	len -= r;
	byte p = 0;
	int offset = MAX_INITIAL_PACKET;
	while (len > 0) {
		//memcpy(resp_buffer, request, 4); //copy cid, doesn't need to recopy
		resp_buffer[4] = p++;
		memcpy(resp_buffer + 5, large_resp_buffer + offset, MAX_CONTINUATION_PACKET);
		RawHID_send(resp_buffer, 64);
		len-= MAX_CONTINUATION_PACKET;
		offset += MAX_CONTINUATION_PACKET;
		// delayMicroseconds(2500);
	}
}

// static int _counter;
int getCounter() {
	uint16_t eeAddress = 0; //EEPROM address to start reading from
	uint16_t counter;
	EE_ReadVariable( eeAddress, &counter );
	DBG_MSG("counter=%d",counter);
	return counter;
}

void setCounter(int counter)
{
	DBG_MSG("counter=%d",counter);
	uint16_t eeAddress = 0; //EEPROM address to start reading from
	// EEPROM.put( eeAddress, counter );
	EE_WriteVariable(eeAddress, counter);
	// _counter=counter;
}

#ifdef SIMULATE_BUTTON
//for now just simulate this
int button_pressed = 0;
#endif

void processMessage(byte *buffer)
{
	int len = buffer[5] << 8 | buffer[6];
#ifdef DEBUG
	DBG_MSG("Got message, len=%d", len);
#endif
	byte *message = buffer + 7;
#ifdef DEBUG
	dump_hex(buffer+7, len);
#endif
	//todo: check CLA = 0
	byte CLA = message[0];

	if (CLA!=0) {
		respondErrorPDU(buffer, SW_CLA_NOT_SUPPORTED);
		return;
	}

	byte INS = message[1];
	byte P1 = message[2];
	//byte P2 = message[3];
	int reqlength = (message[4] << 16) | (message[5] << 8) | message[6];

	switch (INS) {
	case U2F_INS_REGISTER:
		{
			if (reqlength!=64) {
				respondErrorPDU(buffer, SW_WRONG_LENGTH);
				return;
			}

#ifdef SIMULATE_BUTTON
			if (!button_pressed) {
				respondErrorPDU(buffer, SW_CONDITIONS_NOT_SATISFIED);
				button_pressed = 1;
				return;
			}
#endif

			byte *datapart = message + 7;
			byte *challenge_parameter = datapart;
			byte *application_parameter = datapart+32;

			memset(public_k, 0, sizeof(public_k));
			memset(private_k, 0, sizeof(private_k));
			uECC_make_key(public_k + 1, private_k, curve); //so we ca insert 0x04
			public_k[0] = 0x04;
#ifdef DEBUG
			DBG_MSG("Public K");
			dump_hex(public_k,sizeof(public_k));
			DBG_MSG("Private K");
			dump_hex(private_k,sizeof(private_k));
#endif
			//construct hash

