sundw2014/u2f_stm32/Project/src/u2f.cpp
			memcpy(handle, application_parameter, 32);
			memcpy(handle+32, private_k, 32);
			for (int i =0; i < 64; i++) {
				handle[i] ^= handlekey[i%(sizeof(handlekey)-1)];
			}

			SHA256_CTX ctx;
			sha256_init(&ctx);
			large_resp_buffer[0] = 0x00;
			sha256_update(&ctx, large_resp_buffer, 1);
#ifdef DEBUG
			DBG_MSG("App Parameter:");
			dump_hex(application_parameter,32);
#endif
			sha256_update(&ctx, application_parameter, 32);
#ifdef DEBUG
			DBG_MSG("Chal Parameter:");
			dump_hex(challenge_parameter,32);
#endif
			sha256_update(&ctx, challenge_parameter, 32);
#ifdef DEBUG
			DBG_MSG("Handle Parameter:");
			dump_hex(handle,64);
#endif
			sha256_update(&ctx, handle, 64);
			sha256_update(&ctx, public_k, 65);
#ifdef DEBUG
			DBG_MSG("Public key:");
			dump_hex(public_k,65);
#endif
			sha256_final(&ctx, sha256_hash);
#ifdef DEBUG
			DBG_MSG("Hash:");
			dump_hex(sha256_hash,32);
#endif

			uint8_t *signature = resp_buffer; //temporary

			uint8_t tmp[32 + 32 + 64];
			SHA256_HashContext ectx = {{&init_SHA256, &update_SHA256, &finish_SHA256, 64, 32, tmp}};


			uECC_sign_deterministic((uint8_t *)attestation_key,
						sha256_hash,
						32,
						&ectx.uECC,
						signature,
						curve);

			int len = 0;
			large_resp_buffer[len++] = 0x05;
			memcpy(large_resp_buffer + len, public_k, 65);
			len+=65;
			large_resp_buffer[len++] = 64; //length of handle
			memcpy(large_resp_buffer+len, handle, 64);
			len += 64;
			memcpy(large_resp_buffer+len, attestation_der, sizeof(attestation_der));
			len += sizeof(attestation_der)-1;
			//convert signature format
			//http://bitcoin.stackexchange.com/questions/12554/why-the-signature-is-always-65-13232-bytes-long
			large_resp_buffer[len++] = 0x30; //header: compound structure
			uint8_t *total_len = &large_resp_buffer[len];
			large_resp_buffer[len++] = 0x44; //total length (32 + 32 + 2 + 2)
			large_resp_buffer[len++] = 0x02;  //header: integer

			if (signature[0]>0x7f) {
			   	large_resp_buffer[len++] = 33;  //33 byte
				large_resp_buffer[len++] = 0;
				(*total_len)++; //update total length
			}  else {
				large_resp_buffer[len++] = 32;  //32 byte
			}

			memcpy(large_resp_buffer+len, signature, 32); //R value
			len +=32;
			large_resp_buffer[len++] = 0x02;  //header: integer

			if (signature[32]>0x7f) {
				large_resp_buffer[len++] = 33;  //32 byte
				large_resp_buffer[len++] = 0;
				(*total_len)++;	//update total length
			} else {
				large_resp_buffer[len++] = 32;  //32 byte
			}

			memcpy(large_resp_buffer+len, signature+32, 32); //R value
			len +=32;

			byte *last = large_resp_buffer+len;
			APPEND_SW_NO_ERROR(last);
			len += 2;
#ifdef SIMULATE_BUTTON
			button_pressed = 0;
#endif
			sendLargeResponse(buffer, len);
		}

		break;
	case U2F_INS_AUTHENTICATE:
		{
DBG_MSG("U2F_INS_AUTHENTICATE");
			//minimum is 64 + 1 + 64
			if (reqlength!=(64+1+64)) {
				respondErrorPDU(buffer, SW_WRONG_LENGTH);
				return;
			}

			byte *datapart = message + 7;
			byte *challenge_parameter = datapart;
			byte *application_parameter = datapart+32;
			byte handle_len = datapart[64];
			byte *client_handle = datapart+65;

			if (handle_len!=64) {
				//not from this device
				respondErrorPDU(buffer, SW_WRONG_DATA);
				return;
			}
#ifdef SIMULATE_BUTTON
			if (!button_pressed) {
				respondErrorPDU(buffer, SW_CONDITIONS_NOT_SATISFIED);
				button_pressed = 1;
				return;
			}
#endif

			memcpy(handle, client_handle, 64);
			for (int i =0; i < 64; i++) {
				handle[i] ^= handlekey[i%(sizeof(handlekey)-1)];
			}
			uint8_t *key = handle + 32;

			if (memcmp(handle, application_parameter, 32)!=0) {
				//this handle is not from us
				respondErrorPDU(buffer, SW_WRONG_DATA);
				return;
			}

			if (P1==0x07) { //check-only
				DBG_MSG("check-only");
				respondErrorPDU(buffer, SW_CONDITIONS_NOT_SATISFIED);
			} else if (P1==0x03) { //enforce-user-presence-and-sign
				DBG_MSG("enforce");
				int counter = getCounter();
				SHA256_CTX ctx;
				sha256_init(&ctx);
				sha256_update(&ctx, application_parameter, 32);
				large_resp_buffer[0] = 0x01; // user_presence

				int ctr = ((counter>>24)&0xff) | // move byte 3 to byte 0
					((counter<<8)&0xff0000) | // move byte 1 to byte 2
					((counter>>8)&0xff00) | // move byte 2 to byte 1
					((counter<<24)&0xff000000); // byte 0 to byte 3

				memcpy(large_resp_buffer + 1, &ctr, 4);

				sha256_update(&ctx, large_resp_buffer, 5); //user presence + ctr

				sha256_update(&ctx, challenge_parameter, 32);
				sha256_final(&ctx, sha256_hash);

				uint8_t *signature = resp_buffer; //temporary

				uint8_t tmp[32 + 32 + 64];
				SHA256_HashContext ectx = {{&init_SHA256, &update_SHA256, &finish_SHA256, 64, 32, tmp}};

				uECC_sign_deterministic((uint8_t *)key,
							sha256_hash,
							32,
							&ectx.uECC,
							signature,
							curve);

				int len = 5;

				//convert signature format
				//http://bitcoin.stackexchange.com/questions/12554/why-the-signature-is-always-65-13232-bytes-long
				large_resp_buffer[len++] = 0x30; //header: compound structure
				uint8_t *total_len = &large_resp_buffer[len];
				large_resp_buffer[len++] = 0x44; //total length (32 + 32 + 2 + 2)
				large_resp_buffer[len++] = 0x02;  //header: integer

				if (signature[0]>0x7f) {
			   	   large_resp_buffer[len++] = 33;  //33 byte
				   large_resp_buffer[len++] = 0;
				   (*total_len)++; //update total length
				} else {
				   large_resp_buffer[len++] = 32;  //32 byte
				}

				memcpy(large_resp_buffer+len, signature, 32); //R value
				len +=32;
				large_resp_buffer[len++] = 0x02;  //header: integer

				if (signature[32]>0x7f) {
				    large_resp_buffer[len++] = 33;  //32 byte
				    large_resp_buffer[len++] = 0;
				    (*total_len)++;	//update total length
				} else {
				    large_resp_buffer[len++] = 32;  //32 byte
				}

				memcpy(large_resp_buffer+len, signature+32, 32); //R value
				len +=32;
				byte *last = large_resp_buffer+len;
				APPEND_SW_NO_ERROR(last);
				len += 2;
#ifdef DEBUG
				// // Serial.print("Len to send ");
				// // Serial.println(len);
#endif
#ifdef SIMULATE_BUTTON
				button_pressed = 0;
#endif
				sendLargeResponse(buffer, len);

				setCounter(counter+1);
			} else {
				//return error
			}
		}
		break;
	case U2F_INS_VERSION:
		{
			if (reqlength!=0) {
				respondErrorPDU(buffer, SW_WRONG_LENGTH);
				return;
			}
			//reuse input buffer for sending
			SET_MSG_LEN(buffer, 8); //len("U2F_V2") + 2 byte SW
			byte *datapart = buffer + 7;
			memcpy(datapart, "U2F_V2", 6);
			datapart += 6;
			APPEND_SW_NO_ERROR(datapart);
			RawHID_send(buffer, 64);
		}
		break;
	default:
		{
			respondErrorPDU(buffer, SW_INS_NOT_SUPPORTED);
		}
		;
	}

