sundw2014/u2f_stm32/Project/src/u2f.cpp
}

void processPacket(byte *buffer)
{
#ifdef DEBUG
	// // Serial.print("Process CMD ");
#endif
	unsigned char cmd = buffer[4]; //cmd or continuation
#ifdef DEBUG
	// // Serial.println((int)cmd, HEX);
#endif

	int len = buffer[5] << 8 | buffer[6];
	if (cmd > U2FHID_INIT || cmd==U2FHID_LOCK) {
		errorResponse(recv_buffer, ERR_INVALID_CMD);
		return;
	}
	if (cmd==U2FHID_PING) {
		if (len <= MAX_INITIAL_PACKET) {
#ifdef DEBUG
			// Serial.println("Sending ping response");
#endif
			RawHID_send(buffer, 64);
		} else {
			//large packet
			//send first one
#ifdef DEBUG
			DBG_MSG("SENT RESPONSE 3");
#endif
			RawHID_send(buffer, 64);
			// delayMicroseconds(2500);
			len -= MAX_INITIAL_PACKET;
			byte p = 0;
			int offset = 7 + MAX_INITIAL_PACKET;
			while (len > 0) {
				memcpy(resp_buffer, buffer, 4); //copy cid
				resp_buffer[4] = p++;
				memcpy(resp_buffer + 5, buffer + offset, MAX_CONTINUATION_PACKET);
				RawHID_send(resp_buffer, 64);
				len-= MAX_CONTINUATION_PACKET;
				offset += MAX_CONTINUATION_PACKET;
				// delayMicroseconds(2500);
			}
#ifdef DEBUG
			DBG_MSG("Sending large ping response");
#endif
		}
	}
	if (cmd==U2FHID_MSG) {
		processMessage(buffer);
	}

}

void setOtherTimeout()
{
	//we can process the data
	//but if we find another channel is waiting for continuation, we set it as timeout
	for (int i = 0; i < MAX_CHANNEL; i++) {
		if (channel_states[i].state==STATE_CHANNEL_WAIT_CONT) {
#ifdef DEBUG
			DBG_MSG("Set other timeout");
#endif
			channel_states[i].state= STATE_CHANNEL_TIMEOUT;
		}
	}

}

int cont_start = 0;

extern "C" {
void u2f_loop() {
	int n;
// DBG_MSG("alive");
	n = RawHID_recv(recv_buffer, PACK_SIZE);

	if (n > 0) {
		DBG_MSG("new data");

#ifdef DEBUG
#ifndef DESKTOP_TEST
       dump_hex(recv_buffer, n);
#endif
		DBG_MSG("Received packet, CID: ");
#endif
		//int cid = *(int*)recv_buffer;
		int cid; //handle strict-aliasing warning
		memcpy(&cid, recv_buffer, sizeof(cid));
#ifdef DEBUG
		DBG_MSG("cid:%d",cid);
#endif
		if (cid==0) {
			errorResponse(recv_buffer, ERR_INVALID_CID);
			return;
		}

		unsigned char cmd_or_cont = recv_buffer[4]; //cmd or continuation


		int len = (recv_buffer[5]) << 8 | recv_buffer[6];

#ifdef DEBUG
		if (IS_NOT_CONTINUATION_PACKET(cmd_or_cont)) {
			// Serial.print(F("LEN "));
			// Serial.println((int)len);
		}
#endif


		//don't care about cid
		if (cmd_or_cont==U2FHID_INIT) {
			setOtherTimeout();
			cid = initResponse(recv_buffer);
			int cidx = find_channel_index(cid);
			channel_states[cidx].state= STATE_CHANNEL_WAIT_PACKET;
			return;
		}

		if (cid==-1) {
			errorResponse(recv_buffer, ERR_INVALID_CID);
			return;
		}

		int cidx = find_channel_index(cid);

		if (cidx==-1) {
#ifdef DEBUG
			DBG_MSG("allocating new CID");
#endif
			allocate_channel(cid);
			cidx = find_channel_index(cid);
			if (cidx==-1) {
				errorResponse(recv_buffer, ERR_INVALID_CID);
				return;
			}

		}

		if (IS_NOT_CONTINUATION_PACKET(cmd_or_cont)) {

			if (len > MAX_TOTAL_PACKET) {
				errorResponse(recv_buffer, ERR_INVALID_LEN); //invalid length
				return;
			}

			if (len > MAX_INITIAL_PACKET) {
				//if another channel is waiting for continuation, we respond with busy
				for (int i = 0; i < MAX_CHANNEL; i++) {
					if (channel_states[i].state==STATE_CHANNEL_WAIT_CONT) {
						if (i==cidx) {
							errorResponse(recv_buffer, ERR_INVALID_SEQ); //invalid sequence
							channel_states[i].state= STATE_CHANNEL_WAIT_PACKET;
						} else {
							errorResponse(recv_buffer, ERR_CHANNEL_BUSY);
							return;
						}

						return;
					}
				}
				//no other channel is waiting
				channel_states[cidx].state=STATE_CHANNEL_WAIT_CONT;
				cont_start = millis();
				memcpy(large_buffer, recv_buffer, 64);
				large_data_len = len;
				large_data_offset = MAX_INITIAL_PACKET;
				expected_next_packet = 0;
				return;
			}

			setOtherTimeout();
			processPacket(recv_buffer);
			channel_states[cidx].state= STATE_CHANNEL_WAIT_PACKET;
		} else {
DBG_MSG("continuation packet");
			if (channel_states[cidx].state!=STATE_CHANNEL_WAIT_CONT) {
#ifdef DEBUG
				DBG_MSG("ignoring stray packet");
				// Serial.println(cid, HEX);
#endif
				return;
			}

			//this is a continuation
			if (cmd_or_cont != expected_next_packet) {
				DBG_MSG("cmd_or_cont:%d != expected_next_packet:%d", cmd_or_cont, expected_next_packet);
				errorResponse(recv_buffer, ERR_INVALID_SEQ); //invalid sequence
				channel_states[cidx].state= STATE_CHANNEL_WAIT_PACKET;
				return;
			} else {

				memcpy(large_buffer + large_data_offset + 7, recv_buffer + 5, MAX_CONTINUATION_PACKET);
				large_data_offset += MAX_CONTINUATION_PACKET;

				if (large_data_offset < large_data_len) {
					expected_next_packet++;
#ifdef DEBUG
					DBG_MSG("Expecting next cont");
#endif
					return;
				}
#ifdef DEBUG
				DBG_MSG("Completed");
#endif
				channel_states[cidx].state= STATE_CHANNEL_WAIT_PACKET;
				processPacket(large_buffer);
				return;
			}
		}
	} else {

		for (int i = 0; i < MAX_CHANNEL; i++) {
			if (channel_states[i].state==STATE_CHANNEL_TIMEOUT) {
#ifdef DEBUG
				DBG_MSG("send timeout");
				// Serial.println(channel_states[i].cid, HEX);
#endif
				memcpy(recv_buffer, &channel_states[i].cid, 4);
				errorResponse(recv_buffer, ERR_MSG_TIMEOUT);
				channel_states[i].state= STATE_CHANNEL_WAIT_PACKET;

			}
			if (channel_states[i].state==STATE_CHANNEL_WAIT_CONT) {

				int now = millis();
				if ((now - channel_states[i].last_millis)>500) {
#ifdef DEBUG
					DBG_MSG("SET timeout");
#endif
					channel_states[i].state=STATE_CHANNEL_TIMEOUT;
				}
			}
		}
	}
}
}//extern "C"
